---------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/nagibsouki/Desktop/nagib stefano souki 1793926 esame 2 .log
  log type:  text
 opened on:  18 Dec 2021, 05:55:48

. 
. import excel "/Users/nagibsouki/Downloads/emissi
> ons.xls", sheet("DATASET") firstrow
(6 vars, 54 obs)

. 
. do "/var/folders/_y/ks317dnx04q2g2wvy77ss3xc0000
> gn/T//SD47243.000000"

. summarize

    Variable |        Obs        Mean    Std. dev.
>        Min        Max
-------------+------------------------------------
> ---------------------
        Year |          0
     Country |          0
CO2emissio~c |         51    14.65409    3.002683 
>   8.582937   18.54058
      rgdppc |         54    24280.15    7337.379 
>    13356.1   37492.85
        pceu |         53    4721.243    802.0572 
>   3063.554    5882.82
-------------+------------------------------------
> ---------------------
           F |          0

. summarize CO2emissionspc rgdppc pceu

    Variable |        Obs        Mean    Std. dev.
>        Min        Max
-------------+------------------------------------
> ---------------------
CO2emissio~c |         51    14.65409    3.002683 
>   8.582937   18.54058
      rgdppc |         54    24280.15    7337.379 
>    13356.1   37492.85
        pceu |         53    4721.243    802.0572 
>   3063.554    5882.82

. 
end of do-file

. do "/var/folders/_y/ks317dnx04q2g2wvy77ss3xc0000
> gn/T//SD47243.000000"

. keep if CO2emissionspc!=. & rgdppc=. & pceu!=. 
=exp not allowed
r(101);

end of do-file

r(101);

. find exp
command find is unrecognized
r(199);

. do "/var/folders/_y/ks317dnx04q2g2wvy77ss3xc0000
> gn/T//SD47243.000000"

. keep if CO2emissionspc!=. & rgdppc=. & pceu!=. 
=exp not allowed
r(101);

end of do-file

r(101);

. find keep if
command find is unrecognized
r(199);

. findit exp

. do "/var/folders/_y/ks317dnx04q2g2wvy77ss3xc0000
> gn/T//SD47243.000000"

. keep if CO2emissionspc!=. & rgdppc=. & pceu!=. 
=exp not allowed
r(101);

end of do-file

r(101);

. log close
      name:  <unnamed>
       log:  /Users/nagibsouki/Desktop/nagib stefa
> no souki 1793926 esame 2 .log
  log type:  text
 closed on:  18 Dec 2021, 06:36:11
--------------------------------------------------
